<!DOCTYPE html>
<html lang="ja">
<head>
<meta charset="UTF-8">
      <title>タスク4-0-1</title>
</head>
<body>
    <?php
    /*
     * 問1.この初期化は何を表しているか答えなさい
     * 答.$timestamp生成時の引数を表している。
     */
    $hour=0;
    $min=0;
    $sec=0;
    $month=1;
    $day=1;
    $year=2015;


    /*
     * 問2.このループにおける繰り返し条件を答えなさい
     * 答.
     * $dayが365以内の時
     * 問3.このループの目的を答えなさい
     * 答.毎日のタイムスタンプを生成し、日付を表示する目的。
     */
    $befor_month=$month; // ※4_11_demo.phpには書いてあったので追記しました。
    while($day<=365){

        /*
         * 問4.下行の処理の動作を答えなさい
         * 答.$hour, $min, $sec, $month, $day, $yearの総秒を取得する$timestampの生成
         *
         * 問5.なぜ下行のような処理を行っているのかを答えなさい
         * 答.PHPでは総秒で日時の管理をしているため日時に関する関数での扱いがしやすいため。
         */
        $timestamp = mktime($hour, $min, $sec, $month, $day, $year);


        /*
         * 問6.下行の処理の動作を答えなさい
         * 答.$timestampから月の数値をとってきて$now_monthに代入している。
         *
         * 問7.なぜ下行のような処理を行っているのかを答えなさい
         * 答. 条件分岐の条件として月の数値を扱うため。
         */
        $now_month=date('m', $timestamp);

        /*
         * 問8.この条件分岐はどのような条件で行われているのか答えなさい
         * 答.「$before_month(※1月)と$now_monthの数値が異なる時」という条件。
         *
         * 問9.条件分岐の目的を答えなさい
         * 答.新しい月に入った時にその月が表示されてわかりやすくなるため。
         */
        if($befor_month!=$now_month){

            /*
            * 問10.なぜ下行のような処理を行っているのかを答えなさい
            * 答.これにより$dayがカウントアップして新しい月に入るまでif文の条件から外れる。そのため新しい月に入ったことを知らせる表示は1回だけの表示とさせている。
            */
            $befor_month=$now_month;

            /*
            * 問11.下行の処理の動作を答えなさい
            * 答.新しい月に入ったことを見出しとして表示する。
            */
            echo '<br>'.$now_month.'月<br>';
        }

        /*
         * 問12.下行の処理の動作を答えなさい
         * 答.$timestampの総秒を年月日に変換し、総秒とともに表示している。
         * 
         * 問13.なぜ下行のような処理を行っているのか答えなさい
         * 答.$timestampの総秒の違いが日付の表示とどのように関係しているかがわかるため。
         */
        echo date('Y年m月d日', $timestamp).'タイムスタンプ:'.$timestamp.'<br>';

        /*
         * 問14.なぜ下行のような処理を行っているのか答えなさい
         * 答.次のループで1日後の$timestampを生成するため。
         */
        $day++;
    }

    /*
     * 問15.このプログラムは、何を目的とした処理なのかを要約して答えなさい
     * 答.2015年の365日の日付とその総秒を表示することで日付と総秒を視覚的に比較できることを目的としている。
     *
     * 問16.このままでは本来この処理が望んでいる結果になっていない。何が問題で、どこをどう修正すべきか答えなさい
     * 答.1月の表示がされない問題がある。$before_monthの初期値を$monthではなく$month-1とする。
     *
     */

    ?>
</body>
</html>

